In [20]:
import pandas as pd

In [30]:
file = pd.read_csv("C:/Users/maxle/Desktop/Database/Milestone3/expanded_producers.csv")

In [31]:
file.head()

                     FullName   ClipId              Role AddInfos
0        'Abd Al-Hamid Ja'far   742507          producer      NaN
1        'Abd Al-Hamid Ja'far   960777          producer      NaN
2  'babeepower' Viera Michael  4016759  segment producer     2000
3             't Hart Martijn  1431901          producer      NaN
4                't Joen Léon   714863          producer      NaN

In [32]:
ids = pd.read_pickle("C:/Users/maxle/Desktop/Database/Milestone3/namesDictionnary.pkl")

In [33]:
file['personid'] = file['FullName'].map(ids)

In [34]:
file.head()

                     FullName   ClipId              Role AddInfos  personid
0        'Abd Al-Hamid Ja'far   742507          producer      NaN       3.0
1        'Abd Al-Hamid Ja'far   960777          producer      NaN       3.0
2  'babeepower' Viera Michael  4016759  segment producer     2000      56.0
3             't Hart Martijn  1431901          producer      NaN      62.0
4                't Joen Léon   714863          producer      NaN      70.0

In [35]:
file[file['personid'].isnull()]

,FullName,ClipId,Role,AddInfos,personid
381977,Central Saint Martin's College of Art and Desi...,816929,producer,NaN,NaN
2321397,The National Gallery London gb,816929,executive producer,NaN,NaN

In [37]:
file.shape

(2611343, 5)

In [39]:
file = file.dropna(subset = ['personid'])
file.shape

(2611341, 5)

In [42]:
file['personid'] = file['personid'].map(int)

In [40]:
file['producesroleid'] = file.index

In [44]:
file.head()

,FullName,ClipId,Role,AddInfos,personid,producesroleid
0,'Abd Al-Hamid Ja'far,742507,producer,NaN,3,0
1,'Abd Al-Hamid Ja'far,960777,producer,NaN,3,1
2,'babeepower' Viera Michael,4016759,segment producer,2000,56,2
3,'t Hart Martijn,1431901,producer,NaN,62,3
4,'t Joen Léon,714863,producer,NaN,70,4

In [45]:
file.columns = ['fullname','clipid', 'role', 'addinfo', 'personid', 'producesroleid']
file.head()

,fullname,clipid,role,addinfo,personid,producesroleid
0,'Abd Al-Hamid Ja'far,742507,producer,NaN,3,0
1,'Abd Al-Hamid Ja'far,960777,producer,NaN,3,1
2,'babeepower' Viera Michael,4016759,segment producer,2000,56,2
3,'t Hart Martijn,1431901,producer,NaN,62,3
4,'t Joen Léon,714863,producer,NaN,70,4

In [46]:
file['role'] = file['role'].fillna('unknown')
file.head()

,fullname,clipid,role,addinfo,personid,producesroleid
0,'Abd Al-Hamid Ja'far,742507,producer,NaN,3,0
1,'Abd Al-Hamid Ja'far,960777,producer,NaN,3,1
2,'babeepower' Viera Michael,4016759,segment producer,2000,56,2
3,'t Hart Martijn,1431901,producer,NaN,62,3
4,'t Joen Léon,714863,producer,NaN,70,4

In [47]:
file['addinfo'] = file['addinfo'].fillna('')
file.head()

,fullname,clipid,role,addinfo,personid,producesroleid
0,'Abd Al-Hamid Ja'far,742507,producer,,3,0
1,'Abd Al-Hamid Ja'far,960777,producer,,3,1
2,'babeepower' Viera Michael,4016759,segment producer,2000,56,2
3,'t Hart Martijn,1431901,producer,,62,3
4,'t Joen Léon,714863,producer,,70,4

In [48]:
file2 = file[['producesroleid', 'role', 'addinfo']].copy()
file2.head()

   producesroleid              role addinfo
0               0          producer
1               1          producer
2               2  segment producer    2000
3               3          producer
4               4          producer

In [49]:
file2.to_csv("producesroles.csv", index=False, encoding='utf-8')

In [50]:
file = file.drop(['addinfo', 'role', 'fullname'], axis=1)
file.head()

    clipid  personid  producesroleid
0   742507         3               0
1   960777         3               1
2  4016759        56               2
3  1431901        62               3
4   714863        70               4

In [52]:
file = file[['personid', 'clipid', 'producesroleid']]
file.head()

   personid   clipid  producesroleid
0         3   742507               0
1         3   960777               1
2        56  4016759               2
3        62  1431901               3
4        70   714863               4

In [53]:
file.to_csv("produces.csv", index=False, encoding='utf-8')